package astro.axis.planet.libgdx;


public class PlanetDataArray {
    String[] dataMercury = {
            "Меркурий", "2,439 км", "3.302 × 10²³\nкг", "5,427 кг/м³",
            "-35°C до 187°C", "0", "Нет", "58.646 км/ч", "47.870 км/ч",
            "58.65 дней", "87,97 дней", "57.910.000\nкм", "Нет", "Нет",
            "Нет", "Очень\nразреженная", "Термосфера", "Кора\nмантия\nядро",
            "Наименьшая\nпланета\nСолнечной системы\nВысокая доля\nжелеза в составе\nЗначительные\nтемпер. колебания"
    };

    // Insert data for Venus
    String[] dataVenus = {
            "Венера", "6,051 км", "4.867 × 10²⁴\nкг", "5,243 кг/м³", "462°C",
            "Нет", "Нет", "6.520 км/ч", "35.020 км/ч", "243 дня", "224,70 дней",
            "108.200.000\nкм", "Нет", "Нет", "Нет", "Есть", "Тропосфера\nстратосфера\nмезосфера\nтермосфера",
            "Кора\nмантия\nядро", "Вторая планета\nот Солнца\nСамая горячая\nпланета\nПлотная атмосфера\nиз углекислого газа\nОблака из серной\nкислоты\nОбратная вращение"
    };

    // Insert data for Earth
    String[] dataEarth = {
            "Земля", "6,371 км", "5.972 × 10²⁴\nкг", "5,515 г/см³", "14°C", "1", "Луна",
            "1,674 км/ч", "107.2 км/ч", "23 часа 56 мин", "365.25 дней", "149.600.000\nкм", "Нет", "Нет", "Нет",
            "Есть", "Тропосфера\nСтратосфера\nМезосфера\nТермосфера\nЭкзосфера", "Кора\nмантия\nядро",
            "Живые существа\nАтмосфера с\nкислородом\nИзменения\nклимата"
    };

    // Insert data for Mars
    String[] dataMars = {
            "Марс", "3,390 км", "6.417 × 10²³\nкг", "3,933 кг/м³", "-87°C", "2", "Фобос\nДеймос",
            "240.077 км/ч", "24.077 км/ч", "1.026 дней", "687 дней", "227.940.000\nкм", "Нет", "Нет", "Нет",
            "Очень разреженная", "Тропосфера\nстратосфера", "Кора\nмантия\nядро",
            "Красная почва\nТонкая атмосфера\nПолярные шапки\nДвойная система\nспутников\n"
    };

    // Insert data for Jupiter
    String[] dataJupiter = {
            "Юпитер", "69,911 км", "1.898 × 10²⁷\nкг", "1,326 кг/м³", "-145°C", "79", "Европа\nКаллисто\nИо\nГанимед",
            "12.684 км/ч", "13.062 км/ч", "9.925 часов", "11.862 земных\nгода", "778.340.000\nкм", "Есть", "4 основных", "Газовый гигант",
            "Есть", "Тропосфера\nСтратосфера\nМезосфера\nТермосфера", "Горячая\nмантийная зона\nядро",
            "Самая большая\nпланета в\nСолнечной системе\nНаличие сильного\nмагнитного поля\nОгромные полосы\nи штормовые\nобразования"
    };

    // Insert data for Saturn
    String[] dataSaturn = {
            "Сатурн", "58,232 км", "5.683 × 10²⁶\nкг", "0.687 кг/м³", "-185°C", "82", "Титан\nРея\nДиона\nТефия\nЭнцелад",
            "9.690 км/ч", "9.690 км/ч", "10.656 часов", "29.457\nземных лет", "1,429.400.000\nкм", "Есть", "Многочисленные\n7 основных", "Газовый гигант",
            "Есть", "Тропосфера\nСтратосфера\nТермосфера", "Горячая\nмантийная зона\nядро",
            "Наличие спутника\nТитана с\nатмосферой и\nорганическими\nмолекулами\nНаличие спутника\nЭнцелада с\nгейзерами\nводяного льда"
    };

    // Insert data for Uranus
    String[] dataUranus = {
            "Уран", "25,362 км", "8.681 × 10²⁵\nкг", "1.270 кг/м³", "-206°C", "27", "Ариэль\nУмбриэль\nТитания\nОберон",
            "6.810 км/ч", "6.810 км/ч", "17.24 часов", "84.016\nземных лет", "2,870.990.000\nкм", "Есть", "13 основных", "Ледяной гигант",
            "Есть", "Тропосфера\nСтратосфера\nТермосфера", "Горячая\nмантийная зона\nядро",
            "Планета вращается\nпод углом 97.77°\nНаличие метана\nв атмосфере"
    };

    // Insert data for Neptune
    String[] dataNeptune = {
            "Нептун", "24,764 км", "1.024 × 10²⁶\nкг", "1.638 кг/м³", "-201°C", "14", "Тритон\nНерида",
            "5.436 км/ч", "5.436 км/ч", "16.11 часов", "164.79\nземных лет", "4,495.100.000\nкм", "Есть", "5 основных", "Ледяной гигант",
            "Есть", "Тропосфера\nСтратосфера\nТермосфера", "Горячая\nмантийная зона\nядро",
            "Метан в атмосфере\nНаличие сильных\nветров и штормов\nСамая дальняя\nпланета от Солнца"
    };

    public String[] getPlanetData(String planetName) {
        switch (planetName.toLowerCase()) {
            case "mercury":
                return dataMercury;
            case "venus":
                return dataVenus;
            case "earth":
                return dataEarth;
            case "mars":
                return dataMars;
            case "jupiter":
                return dataJupiter;
            case "saturn":
                return dataSaturn;
            case "uranus":
                return dataUranus;
            case "neptune":
                return dataNeptune;
            default:
                throw new IllegalArgumentException("Invalid planet name: " + planetName);
        }
    }
}
